export const collegeCode = new Map([
  ['01', '建筑学院'],
  ['02', '机械工程学院'],
  ['03', '能源与环境学院'],
  ['04', '信息科学与工程学院'],
  ['05', '土木工程学院'],
  ['06', '电子科学与工程学院'],
  ['07', '数学学院'],
  ['08', '自动化学院'],
  ['09', '计算机科学与工程学院'],
  ['10', '物理学院'],
  ['11', '生物科学与医学工程学院'],
  ['12', '材料科学与工程学院'],
  ['13', '人文学院'],
  ['14', '经济管理学院'],
  ['15', '马克思主义学院'],
  ['16', '电气工程学院'],
  ['17', '外国语学院'],
  ['18', '体育系'],
  ['19', '化学化工学院'],
  ['21', '交通学院'],
  ['22', '仪器科学与工程学院'],
  ['24', '艺术学院'],
  ['25', '法学院'],
  ['26', '学习科学研究中心'],
  ['29', '研究生院'],
  ['30', '无锡分校'],
  ['31', '职业技术教育学院'],
  ['33', '高职专科'],
  ['41', '医学院'],
  ['42', '公共卫生学院'],
  ['43', '医学院'],
  ['44', '医学院'],
  ['57', '网络空间安全学院'],
  ['61', '吴健雄学院'],
  ['66', '图书情报'],
  ['71', '软件学院'],
  ['D1', '电子信息类'],
  ['D2', '电子信息类（无锡）'],
  ['G1', '工科试验班 （机械能源材料类）'],
  ['G2', '工科试验班 （自动化电气测控类）'],
  ['G3', '工科试验班 （环境化工生物类）'],
  ['GS', '工商管理类'],
  ['JS', '计算机类'],
  ['LK', '理科试验班'],
  ['TJ', '工科试验班 （土木交通类）'],
]);

export function modify(str) {
  if (collegeCode.has(str)) {
    return collegeCode.get(str);
  } else {
    return str;
  }
}
export function modifyNum(str) {
  let map = new Map([
    ['D1', '72'],
    ['D2', '73'],
    ['G1', '74'],
    ['G2', '75'],
    ['G3', '76'],
    ['GS', '77'],
    ['JS', '78'],
    ['LK', '79'],
    ['TJ', '80'],
  ]);
  if (map.has(str)) {
    return map.get(str);
  } else {
    if (collegeCode.has(str)) {
      return str;
    }
  }
  return '0';
}
